In [17]:
import pandas as pd
import numpy as np

df = pd.read_csv('하반기_학제별_설립별_졸업상황_20200118192818.csv',index_col=0)
df = df.T

In [18]:
del df.columns.name

In [19]:
df.drop('구분별(1)',inplace=True, axis=1)

In [20]:
df.rename(columns={'계': '졸업자수'}, inplace=True)

In [22]:
df.sort_index(ascending=False, inplace=True)

In [23]:
df

        졸업자수
2017  574009
2016  580695
2015  576023
2014  557234
2013  555142
2012  566324
2011  558932

In [24]:
df.to_csv('졸업자수.csv', index=True)

In [25]:
data = pd.read_csv('졸업자수.csv', index_col=0)
data

        졸업자수
2017  574009
2016  580695
2015  576023
2014  557234
2013  555142
2012  566324
2011  558932

In [29]:
df = pd.read_csv('대출수요_20200118191318.csv', index_col=0)
df = df.T
df

계정코드별     국내은행-가계(일반)  국내은행-가계(주택)
2011             8.75        13.50
2012             4.75         3.75
2013             3.00         6.50
2014             7.00        23.50
2015             6.75        30.25
2016             3.50         9.75
2017            13.50         5.25
2018             3.50        -4.25
2019             7.50        -2.25

In [31]:
del df.columns.name

In [36]:
df.rename(columns={'국내은행-가계(일반)':'대출일반', '국내은행-가계(주택)': '대출주택'}, inplace=True)
df.sort_index(ascending=False, inplace=True)
df

           대출일반   대출주택
2019       7.50  -2.25
2018       3.50  -4.25
2017      13.50   5.25
2016       3.50   9.75
2015       6.75  30.25
2014       7.00  23.50
2013       3.00   6.50
2012       4.75   3.75
2011       8.75  13.50

In [37]:
df.to_csv('대출.csv', index=True)

In [39]:
data = pd.read_csv('대출.csv', index_col=0)
data

       대출일반   대출주택
2019   7.50  -2.25
2018   3.50  -4.25
2017  13.50   5.25
2016   3.50   9.75
2015   6.75  30.25
2014   7.00  23.50
2013   3.00   6.50
2012   4.75   3.75
2011   8.75  13.50